facebookincubator/oculus-linux-kernel/drivers/staging/oculus/mcu/swd/swd_registers_stm32l47xxx.h
/* SPDX-License-Identifier: GPL-2.0 */
/* Applies to STM32L47x/L48x/L49x/L4Ax devices */
#ifndef _SWD_REGISTERS_STM32L47XXX_H
#define _SWD_REGISTERS_STM32L47XXX_H

#define SWD_STM32L47XXX_FLASH_MEM_START_ADDR  0x08000000

#define SWD_STM32L47XXX_FLASH_BASE   0x40022000
#define SWD_STM32L47XXX_FLASH_KEYR   (SWD_STM32L47XXX_FLASH_BASE + 0x08)
#define SWD_STM32L47XXX_FLASH_SR     (SWD_STM32L47XXX_FLASH_BASE + 0x10)
#define SWD_STM32L47XXX_FLASH_CR     (SWD_STM32L47XXX_FLASH_BASE + 0x14)

#define SWD_STM32L47XXX_FLASH_KEYR_Key1   0x45670123
#define SWD_STM32L47XXX_FLASH_KEYR_Key2   0xCDEF89AB

#define SWD_STM32L47XXX_FLASH_SR_EOP       (1<<0)
#define SWD_STM32L47XXX_FLASH_SR_OPERR     (1<<1)
#define SWD_STM32L47XXX_FLASH_SR_PROGERR   (1<<3)
#define SWD_STM32L47XXX_FLASH_SR_WRPERR    (1<<4)
#define SWD_STM32L47XXX_FLASH_SR_PGAERR    (1<<5)
#define SWD_STM32L47XXX_FLASH_SR_SIZERR    (1<<6)
#define SWD_STM32L47XXX_FLASH_SR_PGSERR    (1<<7)
#define SWD_STM32L47XXX_FLASH_SR_MISSERR   (1<<8)
#define SWD_STM32L47XXX_FLASH_SR_FASTERR   (1<<9)
#define SWD_STM32L47XXX_FLASH_SR_RDERR     (1<<14)
#define SWD_STM32L47XXX_FLASH_SR_OPTVERR   (1<<15)

#define SWD_STM32L47XXX_FLASH_SR_ERR_Mask  \
	(SWD_STM32L47XXX_FLASH_SR_OPERR    | \
	 SWD_STM32L47XXX_FLASH_SR_PROGERR  | \
	 SWD_STM32L47XXX_FLASH_SR_WRPERR   | \
	 SWD_STM32L47XXX_FLASH_SR_PGAERR   | \
	 SWD_STM32L47XXX_FLASH_SR_SIZERR   | \
	 SWD_STM32L47XXX_FLASH_SR_PGSERR   | \
	 SWD_STM32L47XXX_FLASH_SR_MISSERR  | \
	 SWD_STM32L47XXX_FLASH_SR_FASTERR  | \
	 SWD_STM32L47XXX_FLASH_SR_RDERR    | \
	 SWD_STM32L47XXX_FLASH_SR_OPTVERR)

#define SWD_STM32L47XXX_FLASH_SR_BSY   (1<<16)

#define SWD_STM32L47XXX_FLASH_CR_PG           (1<<0)
#define SWD_STM32L47XXX_FLASH_CR_PER          (1<<1)
#define SWD_STM32L47XXX_FLASH_CR_MER1         (1<<2)
#define SWD_STM32L47XXX_FLASH_CR_PNB_Pos      (3)
#define SWD_STM32L47XXX_FLASH_CR_PNB_Mask     (0xFF<<SWD_STM32L47XXX_FLASH_CR_PNB_Pos)
#define SWD_STM32L47XXX_FLASH_CR_BKER         (1<<11)
#define SWD_STM32L47XXX_FLASH_CR_MER2         (1<<15)
#define SWD_STM32L47XXX_FLASH_CR_STRT         (1<<16)
#define SWD_STM32L47XXX_FLASH_CR_OPTSTRT      (1<<17)
#define SWD_STM32L47XXX_FLASH_CR_FSTPG        (1<<18)
#define SWD_STM32L47XXX_FLASH_CR_EOPIE        (1<<24)
#define SWD_STM32L47XXX_FLASH_CR_ERRIE        (1<<25)
#define SWD_STM32L47XXX_FLASH_CR_RDERRIE      (1<<26)
#define SWD_STM32L47XXX_FLASH_CR_OBL_LAUNCH   (1<<27)
#define SWD_STM32L47XXX_FLASH_CR_OPTLOCK      (1<<30)
#define SWD_STM32L47XXX_FLASH_CR_LOCK         (1<<31)

#define SWD_STM32L47XXX_DBG_BASE               0xE0042000
#define SWD_STM32L47XXX_DBG_IDCODE             (SWD_STM32L47XXX_DBG_BASE + 0x00)
#define SWD_STM32L47XXX_DBG_IDCODE_DEVID_MASK  (0xfff)
#define DEVID_STM32L44XXX                      0x435
#define DEVID_STM32L47XXX                      0x461

#define SWD_STM32L47XXX_NVM_EEPROM_BASE	0x000FF800

#endif // _SWD_REGISTERS_STM32L47XXX_H
